app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Matt"], ["last_name", "Edwards"], ["updated_at", "2020-04-11 17:08:24.813212"], ["id", 3]]
---
  def update
    find_student
    @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_student
    @student = Student.find_by_id(params[:id])